statistics.json
{
  "Update Products" : {
    "transaction" : "Update Products",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.90000000000002,
    "medianResTime" : 79.0,
    "minResTime" : 78.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 83.0,
    "pct3ResTime" : 83.0,
    "throughput" : 1.1450818733539447,
    "receivedKBytesPerSec" : 1.2009940742013052,
    "sentKBytesPerSec" : 0.22364880338944232
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 132.43999999999997,
    "medianResTime" : 79.5,
    "minResTime" : 78.0,
    "maxResTime" : 575.0,
    "pct1ResTime" : 319.8,
    "pct2ResTime" : 321.0,
    "pct3ResTime" : 575.0,
    "throughput" : 5.235602094240838,
    "receivedKBytesPerSec" : 5.609865837696335,
    "sentKBytesPerSec" : 0.8957787958115182
  },
  "GET Request without Any Param" : {
    "transaction" : "GET Request without Any Param",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 344.20000000000005,
    "medianResTime" : 319.0,
    "minResTime" : 316.0,
    "maxResTime" : 575.0,
    "pct1ResTime" : 549.6000000000001,
    "pct2ResTime" : 575.0,
    "pct3ResTime" : 575.0,
    "throughput" : 1.0835410120273052,
    "receivedKBytesPerSec" : 1.1364482880052011,
    "sentKBytesPerSec" : 0.1312100444251815
  },
  "Delete Products" : {
    "transaction" : "Delete Products",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.3,
    "medianResTime" : 79.0,
    "minResTime" : 78.0,
    "maxResTime" : 81.0,
    "pct1ResTime" : 80.9,
    "pct2ResTime" : 81.0,
    "pct3ResTime" : 81.0,
    "throughput" : 1.1450818733539447,
    "receivedKBytesPerSec" : 1.263615739150349,
    "sentKBytesPerSec" : 0.23483124355891444
  },
  "Post Products with Body" : {
    "transaction" : "Post Products with Body",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.3,
    "medianResTime" : 79.0,
    "minResTime" : 78.0,
    "maxResTime" : 81.0,
    "pct1ResTime" : 80.9,
    "pct2ResTime" : 81.0,
    "pct3ResTime" : 81.0,
    "throughput" : 1.1453441759248653,
    "receivedKBytesPerSec" : 0.6084640934600848,
    "sentKBytesPerSec" : 0.22817403504753178
  },
  "Get with Request Parameter" : {
    "transaction" : "Get with Request Parameter",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.5,
    "medianResTime" : 79.5,
    "minResTime" : 79.0,
    "maxResTime" : 80.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 80.0,
    "pct3ResTime" : 80.0,
    "throughput" : 1.1450818733539447,
    "receivedKBytesPerSec" : 1.86075804420016,
    "sentKBytesPerSec" : 0.1543176743387152
  }
}