statistics.json
{
  "Update Products" : {
    "transaction" : "Update Products",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.0,
    "medianResTime" : 166.0,
    "minResTime" : 166.0,
    "maxResTime" : 166.0,
    "pct1ResTime" : 166.0,
    "pct2ResTime" : 166.0,
    "pct3ResTime" : 166.0,
    "throughput" : 6.024096385542169,
    "receivedKBytesPerSec" : 9.153802710843372,
    "sentKBytesPerSec" : 1.1765813253012047
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.2,
    "medianResTime" : 63.0,
    "minResTime" : 58.0,
    "maxResTime" : 285.0,
    "pct1ResTime" : 285.0,
    "pct2ResTime" : 285.0,
    "pct3ResTime" : 285.0,
    "throughput" : 7.9113924050632916,
    "receivedKBytesPerSec" : 33.88764586629747,
    "sentKBytesPerSec" : 1.3535897943037976
  },
  "GET Request without Any Param" : {
    "transaction" : "GET Request without Any Param",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 285.0,
    "medianResTime" : 285.0,
    "minResTime" : 285.0,
    "maxResTime" : 285.0,
    "pct1ResTime" : 285.0,
    "pct2ResTime" : 285.0,
    "pct3ResTime" : 285.0,
    "throughput" : 3.5087719298245617,
    "receivedKBytesPerSec" : 8.771929824561404,
    "sentKBytesPerSec" : 0.424890350877193
  },
  "Delete Products" : {
    "transaction" : "Delete Products",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.0,
    "medianResTime" : 58.0,
    "minResTime" : 58.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 58.0,
    "pct2ResTime" : 58.0,
    "pct3ResTime" : 58.0,
    "throughput" : 17.241379310344826,
    "receivedKBytesPerSec" : 43.541217672413794,
    "sentKBytesPerSec" : 3.53582974137931
  },
  "Post Products with Body" : {
    "transaction" : "Post Products with Body",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.0,
    "medianResTime" : 59.0,
    "minResTime" : 59.0,
    "maxResTime" : 59.0,
    "pct1ResTime" : 59.0,
    "pct2ResTime" : 59.0,
    "pct3ResTime" : 59.0,
    "throughput" : 16.949152542372882,
    "receivedKBytesPerSec" : 16.833289194915256,
    "sentKBytesPerSec" : 3.3765889830508478
  },
  "Get with Request Parameter" : {
    "transaction" : "Get with Request Parameter",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 63.0,
    "medianResTime" : 63.0,
    "minResTime" : 63.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 63.0,
    "pct2ResTime" : 63.0,
    "pct3ResTime" : 63.0,
    "throughput" : 15.873015873015872,
    "receivedKBytesPerSec" : 220.30009920634922,
    "sentKBytesPerSec" : 2.1391369047619047
  }
}